// 0. Вывести квадрат числа

Console.WriteLine("Введите число: ");
double a = Convert.ToDouble(Console.ReadLine());
Console.WriteLine("{0} в квадрате {1}", a, Math.Pow(a, 2));
Console.ReadLine();