// Написать программу вычисления значения функции y = f(a)
// y = 2a + 3

Console.Write("Введите число: ");
int a = int.Parse(Console.ReadLine());

Console.Write(2 * a + 3);

